<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#python连接mysql数据库" data-toc-modified-id="python连接mysql数据库-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>python连接mysql数据库</a></span></li><li><span><a href="#SQL" data-toc-modified-id="SQL-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>SQL</a></span><ul class="toc-item"><li><span><a href="#库操作" data-toc-modified-id="库操作-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>库操作</a></span><ul class="toc-item"><li><span><a href="#查看数据库" data-toc-modified-id="查看数据库-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>查看数据库</a></span></li><li><span><a href="#创建数据库" data-toc-modified-id="创建数据库-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>创建数据库</a></span></li><li><span><a href="#删除数据库" data-toc-modified-id="删除数据库-2.1.3"><span class="toc-item-num">2.1.3&nbsp;&nbsp;</span>删除数据库</a></span></li><li><span><a href="#查看已经创建好的数据库" data-toc-modified-id="查看已经创建好的数据库-2.1.4"><span class="toc-item-num">2.1.4&nbsp;&nbsp;</span>查看已经创建好的数据库</a></span></li><li><span><a href="#修改数据库编码" data-toc-modified-id="修改数据库编码-2.1.5"><span class="toc-item-num">2.1.5&nbsp;&nbsp;</span>修改数据库编码</a></span></li><li><span><a href="#使用某个数据库" data-toc-modified-id="使用某个数据库-2.1.6"><span class="toc-item-num">2.1.6&nbsp;&nbsp;</span>使用某个数据库</a></span></li></ul></li><li><span><a href="#表操作对应DataFrame的属性和方法" data-toc-modified-id="表操作对应DataFrame的属性和方法-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>表操作对应DataFrame的属性和方法</a></span><ul class="toc-item"><li><span><a href="#df.head(2)近似操作" data-toc-modified-id="df.head(2)近似操作-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>df.head(2)近似操作</a></span></li><li><span><a href="#df.shape的近似操作" data-toc-modified-id="df.shape的近似操作-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>df.shape的近似操作</a></span></li><li><span><a href="#df.index的近似操作-无" data-toc-modified-id="df.index的近似操作-无-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>df.index的近似操作-无</a></span></li><li><span><a href="#df.columns的近似操作" data-toc-modified-id="df.columns的近似操作-2.2.4"><span class="toc-item-num">2.2.4&nbsp;&nbsp;</span>df.columns的近似操作</a></span></li><li><span><a href="#df.info()近似操作" data-toc-modified-id="df.info()近似操作-2.2.5"><span class="toc-item-num">2.2.5&nbsp;&nbsp;</span>df.info()近似操作</a></span></li><li><span><a href="#df.describe()的近似操作" data-toc-modified-id="df.describe()的近似操作-2.2.6"><span class="toc-item-num">2.2.6&nbsp;&nbsp;</span>df.describe()的近似操作</a></span></li><li><span><a href="#df.sort_values()近似操作" data-toc-modified-id="df.sort_values()近似操作-2.2.7"><span class="toc-item-num">2.2.7&nbsp;&nbsp;</span>df.sort_values()近似操作</a></span></li><li><span><a href="#df.drop_duplicates()近似操作" data-toc-modified-id="df.drop_duplicates()近似操作-2.2.8"><span class="toc-item-num">2.2.8&nbsp;&nbsp;</span>df.drop_duplicates()近似操作</a></span></li><li><span><a href="#df.isna()近似操作" data-toc-modified-id="df.isna()近似操作-2.2.9"><span class="toc-item-num">2.2.9&nbsp;&nbsp;</span>df.isna()近似操作</a></span></li></ul></li><li><span><a href="#DataFrame对象的列操作和行操作" data-toc-modified-id="DataFrame对象的列操作和行操作-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>DataFrame对象的列操作和行操作</a></span><ul class="toc-item"><li><span><a href="#增加列" data-toc-modified-id="增加列-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>增加列</a></span></li><li><span><a href="#移动列" data-toc-modified-id="移动列-2.3.2"><span class="toc-item-num">2.3.2&nbsp;&nbsp;</span>移动列</a></span></li><li><span><a href="#修改列" data-toc-modified-id="修改列-2.3.3"><span class="toc-item-num">2.3.3&nbsp;&nbsp;</span>修改列</a></span><ul class="toc-item"><li><span><a href="#修改列的名" data-toc-modified-id="修改列的名-2.3.3.1"><span class="toc-item-num">2.3.3.1&nbsp;&nbsp;</span>修改列的名</a></span></li><li><span><a href="#修改列的值" data-toc-modified-id="修改列的值-2.3.3.2"><span class="toc-item-num">2.3.3.2&nbsp;&nbsp;</span>修改列的值</a></span></li></ul></li><li><span><a href="#删除列" data-toc-modified-id="删除列-2.3.4"><span class="toc-item-num">2.3.4&nbsp;&nbsp;</span>删除列</a></span></li></ul></li></ul></li></ul></div>

In [1]:
# 设置全部行输出
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import pandas as pd

# python连接mysql数据库

In [3]:
# 导包
import pymysql 

# 创建连接对象
mydb = pymysql.connect(  
                   host="localhost",          # 数据库主机地址
                   user="root",               # 数据库用户名
                   password="1234"  ,         # 数据库密码
                   database=None,             # 可以指定连接某个数据库
                   port=3306,                 # 端口号, 默认是3306
                   charset='utf8'             # 使用的编码
                   )  

# 创建游标对象, 这里创建的游标是  可以返回带字段名的字典， 比较好用
mycursor = mydb.cursor(cursor=pymysql.cursors.DictCursor)

# SQL

## 库操作

### 查看数据库

In [4]:
# 通过游标对象的execute方法执行sql语句
mycursor.execute('''
                 show databases;
''')
pd.DataFrame(mycursor)

9

             Database
0  information_schema
1              学生管理系统
2               mysql
3       pandas_to_sql
4  performance_schema
5              python
6              school
7                 sys
8                test

In [5]:
mycursor.description  # 列名是'Database

# 这里也可以查询出列名

(('Database', 253, None, 64, 64, 0, False),)

### 创建数据库  
新创建的数据库名字不能和sql中的关键字一样， 也不能和已经存在的数据库重名

In [6]:
mycursor.execute('''
                 create database 数据库;
''')
pd.DataFrame(mycursor)  # 创建数据库不会有返回结果

1

Empty DataFrame
Columns: []
Index: []

In [7]:
# 再次查询以便就有了  数据库
mycursor.execute('''
                 show databases;
''')
pd.DataFrame(mycursor)

10

             Database
0  information_schema
1              学生管理系统
2                 数据库
3               mysql
4       pandas_to_sql
5  performance_schema
6              python
7              school
8                 sys
9                test

### 删除数据库

In [8]:
mycursor.execute('''
                 drop database 数据库;
''')
pd.DataFrame(mycursor)

0

Empty DataFrame
Columns: []
Index: []

### 查看已经创建好的数据库  
返回该数据的一些信息

In [9]:
mycursor.execute('''
                 show create database 学生管理系统;
''')
a = pd.DataFrame(mycursor)
a

1

  Database                                    Create Database
0   学生管理系统  CREATE DATABASE `学生管理系统` /*!40100 DEFAULT CHAR...

In [10]:
a.values  # 可以看出该数据库编码是utf8

array([['学生管理系统',
        'CREATE DATABASE `学生管理系统` /*!40100 DEFAULT CHARACTER SET utf8 */']],
      dtype=object)

### 修改数据库编码

In [11]:
mycursor.execute('''
                alter database 学生管理系统 character set gbk;
''')

1

In [12]:
pd.DataFrame(mycursor)

Empty DataFrame
Columns: []
Index: []

In [13]:
mycursor.execute('''
                 show create database 学生管理系统;
''')
a = pd.DataFrame(mycursor)
a

1

  Database                                    Create Database
0   学生管理系统  CREATE DATABASE `学生管理系统` /*!40100 DEFAULT CHAR...

In [15]:
a.values  # 编码已经修改成gbk

array([['学生管理系统',
        'CREATE DATABASE `学生管理系统` /*!40100 DEFAULT CHARACTER SET gbk */']],
      dtype=object)

### 使用某个数据库

In [16]:
mycursor.execute('''
                 use 学生管理系统;
''')
pd.DataFrame(mycursor)

0

Empty DataFrame
Columns: []
Index: []

## 表操作对应DataFrame的属性和方法

In [6]:
mycursor.execute('''
                 use school;
''')
pd.DataFrame(mycursor)

0

Empty DataFrame
Columns: []
Index: []

In [9]:
mycursor.execute('''
                 show tables;
''')
pd.DataFrame(mycursor)

1

  Tables_in_school
0              stu

In [10]:
#使用包含列表的字典创建DataFrame时,各个列表内元素个数必须一致
data = {'人物姓名':['小明','小高','小婉'],   #默认字典的键为dataframe的字段名,不设定索引的时候,自动给出默认索引,从0到len(list)-1
         '语文':[88,90,67],
         '数学':[60,40,100],
         '英语':[78, 89, 87]
         }
data = pd.DataFrame(data)
data

  人物姓名  语文   数学  英语
0   小明  88   60  78
1   小高  90   40  89
2   小婉  67  100  87

In [11]:
# 创建数据库引擎
from sqlalchemy import create_engine
engine = create_engine("mysql+mysqlconnector://root:1234@localhost:3306/school?charset=utf8")

# 这里需要先安装：pip install mysql-connector-python -i https://pypi.douban.com/simple
# 这里如果使用pymysql会有一点问题， 建议就使用mysql-connector-python

In [12]:
data.to_sql(name='data', con=engine, index=False)

# name是表名
# con是数据库引擎
# index=False忽略原行索引

### df.head(2)近似操作

In [43]:
data.head(2)

  人物姓名  语文  数学  英语
0   小明  88  60  78
1   小高  90  40  89

In [60]:
mycursor.execute('''
                select * from data
                limit 2;
''')
pd.DataFrame(mycursor)

2

  人物姓名  语文  数学  英语
0   小明  88  60  78
1   小高  90  40  89

### df.shape的近似操作

In [14]:
data

  人物姓名  语文   数学  英语
0   小明  88   60  78
1   小高  90   40  89
2   小婉  67  100  87

In [13]:
mycursor.execute('''
                 select count(*) as 行数 from data;

''')
pd.DataFrame(mycursor)

1

   行数
0   3

In [15]:
mycursor.execute('''
                select count(COLUMN_NAME) as 列数 from information_schema.columns 
                where table_schema='school' and table_name='data';

''')
pd.DataFrame(mycursor)

1

   列数
0   4

### df.index的近似操作-无  
数据库中是没有index的

### df.columns的近似操作

In [17]:
mycursor.execute('''
                select COLUMN_NAME as 列名 from information_schema.columns 
                where table_schema='school' and table_name='data';

''')
pd.DataFrame(mycursor)

4

     列名
0  人物姓名
1    语文
2    数学
3    英语

### df.info()近似操作

In [18]:
mycursor.execute('''
               desc data;
''')
pd.DataFrame(mycursor)

4

  Field        Type Null Key Default Extra
0  人物姓名        text  YES        None
1    语文  bigint(20)  YES        None
2    数学  bigint(20)  YES        None
3    英语  bigint(20)  YES        None

### df.describe()的近似操作

In [20]:
data

  人物姓名  语文   数学  英语
0   小明  88   60  78
1   小高  90   40  89
2   小婉  67  100  87

In [27]:
data.describe().T

    count       mean        std   min   25%   50%   75%    max
语文    3.0  81.666667  12.741010  67.0  77.5  88.0  89.0   90.0
数学    3.0  66.666667  30.550505  40.0  50.0  60.0  80.0  100.0
英语    3.0  84.666667   5.859465  78.0  82.5  87.0  88.0   89.0

In [32]:
mycursor.execute('''
               select 
               count(语文) count, avg(语文) mean, min(语文) min , max(语文) max
               from data;
''')
pd.DataFrame(mycursor)

1

   count     mean  min  max
0      3  81.6667   67   90

### df.sort_values()近似操作

In [36]:
data.sort_values('数学', ascending=False)

  人物姓名  语文   数学  英语
2   小婉  67  100  87
0   小明  88   60  78
1   小高  90   40  89

In [40]:
mycursor.execute('''
               select * from data
               order by 数学 desc;
''')
pd.DataFrame(mycursor)

3

  人物姓名  语文   数学  英语
0   小婉  67  100  87
1   小明  88   60  78
2   小高  90   40  89

### df.drop_duplicates()近似操作

In [41]:
data.drop_duplicates()

  人物姓名  语文   数学  英语
0   小明  88   60  78
1   小高  90   40  89
2   小婉  67  100  87

In [68]:
mycursor.execute('''
               select distinct* from data;
               
''')
pd.DataFrame(mycursor)

3

  人物姓名  语文   数学  英语
0   小明  88   60  78
1   小高  90   40  89
2   小婉  67  100  87

### df.isna()近似操作

In [72]:
data[data.数学.isna()]

Empty DataFrame
Columns: [人物姓名, 语文, 数学, 英语]
Index: []

In [73]:
mycursor.execute('''
               select * from data
               where 数学 is null
               ;
               
''')
pd.DataFrame(mycursor)

0

Empty DataFrame
Columns: []
Index: []

## DataFrame对象的列操作和行操作

### 增加列

In [74]:
data

  人物姓名  语文   数学  英语
0   小明  88   60  78
1   小高  90   40  89
2   小婉  67  100  87

In [75]:
# 增加一列字段 性别
mycursor.execute('''
               alter table data add 性别 varchar(10);
''')
pd.DataFrame(mycursor)

0

Empty DataFrame
Columns: []
Index: []

In [76]:
mycursor.execute('''
               select*from data;
''')
pd.DataFrame(mycursor)

3

  人物姓名  语文   数学  英语    性别
0   小明  88   60  78  None
1   小高  90   40  89  None
2   小婉  67  100  87  None

In [87]:
# 给 性别 传入值
mycursor.execute('''
               update data set 性别='男';
''')
pd.DataFrame(mycursor)

3

Empty DataFrame
Columns: []
Index: []

In [88]:
mycursor.execute('''
               select*from data;
''')
pd.DataFrame(mycursor)

3

  人物姓名  语文   数学  英语 性别
0   小明  88   60  78  男
1   小高  90   40  89  男
2   小婉  67  100  87  男

In [89]:
# 给 性别 传入值
mycursor.execute('''
               update data set 性别='女'
               where 人物姓名='小婉'
               ;
''')
pd.DataFrame(mycursor)

1

Empty DataFrame
Columns: []
Index: []

In [90]:
mycursor.execute('''
               select*from data;
''')
pd.DataFrame(mycursor)

3

  人物姓名  语文   数学  英语 性别
0   小明  88   60  78  男
1   小高  90   40  89  男
2   小婉  67  100  87  女

### 移动列

In [92]:
# 把 性别 移动到 人物姓名 之后
mycursor.execute('''
               alter table data modify 性别 varchar(10) after 人物姓名;
''')
pd.DataFrame(mycursor)

0

Empty DataFrame
Columns: []
Index: []

In [93]:
mycursor.execute('''
               select*from data;
''')
pd.DataFrame(mycursor)

3

  人物姓名 性别  语文   数学  英语
0   小明  男  88   60  78
1   小高  男  90   40  89
2   小婉  女  67  100  87

### 修改列

#### 修改列的名

In [94]:
# 把 人物姓名 修改为 姓名
mycursor.execute('''
               alter table data change 人物姓名 姓名 varchar(10);
''')
pd.DataFrame(mycursor)

3

Empty DataFrame
Columns: []
Index: []

In [95]:
mycursor.execute('''
               select*from data;
''')
pd.DataFrame(mycursor)

3

   姓名 性别  语文   数学  英语
0  小明  男  88   60  78
1  小高  男  90   40  89
2  小婉  女  67  100  87

#### 修改列的值

In [96]:
# 将小明的数学改为100
mycursor.execute('''
                update data set 数学=100
                where 姓名='小明';

''')

1

In [97]:
mycursor.execute('''
               select*from data;
''')
pd.DataFrame(mycursor)

3

   姓名 性别  语文   数学  英语
0  小明  男  88  100  78
1  小高  男  90   40  89
2  小婉  女  67  100  87

### 删除列

In [98]:
mycursor.execute('''
                alter table data drop 性别; 
''')

0

In [99]:
mycursor.execute('''
               select*from data;
''')
pd.DataFrame(mycursor)

3

   姓名  语文   数学  英语
0  小明  88  100  78
1  小高  90   40  89
2  小婉  67  100  87